[
  {
    "title": "Supercell boss: 'We need to take bigger risks'",
    "date": "24 June 2025",
    "author": "Ben Morris",
    "summary": "Ilkka Paananen, CEO of Finnish gaming giant Supercell, believes the mobile gaming industry needs bold innovation. Despite the success of Clash of Clans and Brawl Stars, he’s increased investment in new games and studios to reimagine mobile gaming by 2030. He notes that 60% of mobile gaming time is spent on titles over six years old, while only 10% goes to newer games—highlighting the need for fresh experiences. Competition for users’ time is tougher now, with games competing not just against each other but also with social media and streaming services.Mobile game development has become more expensive, as smartphone capabilities and consumer expectations have grown. Recent Supercell releases like Squad Busters and Mo.co have seen mixed success. Industry expert Neil Long explains that the high cost and visibility of failure deter risk-taking, suggesting that the age of massive game launches may be fading in favor of gradual, player-informed development.",
    "image": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/eea1/live/1b33a740-4b8c-11f0-8c47-237c2e4015f5.jpg.webp"
  },
  {
    "title": "Indian scientists search for the perfect apple",
    "date": "13 June 2025",
    "author": "Priti Gupta",
    "summary": "Farmer Kakasaheb Sawant is growing apples in Maharashtra's hot climate, drawing attention but facing challenges with taste and commercial viability. He hopes future harvests will improve as trees adapt. With India’s apple demand rising and imports reaching 600,000 tonnes, local production struggles due to aging orchards and climate change in traditional regions like Himachal and Kashmir.To expand cultivation, scientists are testing low-chill apple varieties in subtropical areas like Ranchi, but results are modest due to poor soil and pests. Experts like Dr. Dinesh Thakur doubt large-scale success in hot areas, calling such apples better for novelty gardens. His team focuses on early-ripening, climate-resilient varieties in cooler altitudes. Analyst S. Chandrashekhar says boosting output needs not just research, but major investment, orchard renewal, and apple-based industry growth.",
    "image": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/8969/live/54cf68e0-2a4e-11f0-a8b0-31dbf9c39693.jpg.webp"
  }
]
