[
  {
    "title": "Superman review: 'Bursting with geeky weirdness'",
    "date": "Tue 8 Jul 2025",
    "author": "Nicholas Barber",
    "summary": "The new Superman film isn't just a reboot—it's the start of an entirely new DC cinematic universe, following the collapse of the previous one in 2023. James Gunn, known for Guardians of the Galaxy and The Suicide Squad, is now in charge, bringing his signature weirdness and irreverence to the character. Instead of an origin story, the film jumps into Superman's life mid-career. David Corenswet plays a well-established Superman, already fighting crime, dating Lois Lane (Rachel Brosnahan), and battling Lex Luthor (Nicholas Hoult). He’s also joined by oddball heroes like Green Lantern, Mr Terrific, and Hawkgirl. Gunn embraces DC’s quirky lore—Superdog Krypto, Superman Robots, and outlandish sci-fi elements like pocket universes and dimensional imps. While the fun, fast-paced storytelling skips the usual clichés, it also feels chaotic and overstuffed. The film blends satire, superhero antics, and political commentary, but risks feeling like a one-shot passion project rather than a careful universe launch.",
    "image": "https://ichef.bbci.co.uk/images/ic/1024xn/p0lnx2q2.jpg.webp"
  },
  {
    "title": "Jurassic World Rebirth review: 'Stale' and with 'few thrills', it may be the weakest of the franchise",
    "date": "30 June 2025",
    "author": "Caryn James",
    "summary": "Jurassic World: Rebirth, starring Scarlett Johansson and Jonathan Bailey, aims to revive the magic of Jurassic Park but falls short. The plot—dinosaurs, DNA, and corporate greed—feels familiar, with Johansson as a mercenary and Bailey as a palaeontologist on a dangerous island mission. While the visuals and creature designs impress, the action lacks suspense and originality. A parallel subplot featuring a stranded family provides more tension than the main story. Mahershala Ali and Rupert Friend add star power, but their arcs are predictable. Director Gareth Edwards delivers moments of awe but relies too much on clichés. Giant dinos like Titanosaurus and Mosasaurus dazzle visually but aren’t truly scary. Alexandre Desplat’s score, with nods to John Williams’ classic theme, brings nostalgic charm. Ultimately, *Rebirth* highlights how Spielberg’s original still reigns supreme.",
    "image": "https://ichef.bbci.co.uk/images/ic/1024xn/p0lm7z1m.jpg.webp"
  }
]
