[
  {
    "title": "India 'had no right to complain about time-wasting'",
    "date": "12 July 2025",
    "author": "Matthew Henry",
    "summary": "Day 3 of the India-England Test at Lord’s ended in fiery drama as Zak Crawley delayed facing Jasprit Bumrah, calling for a physio after being hit, reducing the overs to one. India’s players, especially Shubman Gill, reacted angrily, with heated exchanges and gestures between both sides. England’s bowling coach Tim Southee called India’s complaints ironic, citing their own delays earlier, including Gill’s mid-game massage. India had hoped to bowl two overs and snag a late wicket but were frustrated by the tactics. Former captains Michael Vaughan and Alastair Cook agreed both teams had wasted time but praised the drama. Crawley and Duckett survived the lone over, ending the day 2-0 and two runs ahead. Crowd reactions were mixed, with cheers and boos for Crawley’s call for medical attention. Tensions boiled over with finger-pointing, sarcastic claps, and sledging from both teams. The incident added spice to an already intense series tied at 1-1. Cook said the late-day fireworks were the rivalry spark the five-match series needed.",
    "image": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/e757/live/e2dcb040-5f58-11f0-b5c5-012c5796682d.jpg.webp"
  },
  {
    "title": "Messi has scored eight goals in his last four MLS games",
    "date": "Wed 10 Jul 2025",
    "author": "Paul Battison",
    "summary": "Lionel Messi became the first player to score multiple goals in four straight MLS games, leading Inter Miami to a 2-1 win over New England Revolution. He netted twice in the first half, bringing his tally to 14 goals in 15 MLS matches this season. Messi began his scoring streak in May with wins over Montreal and Columbus before playing in the Club World Cup. He scored once in four games there as Miami were eliminated by PSG. Returning to MLS, he helped Miami beat Montreal 4-1 last week. Coach Javier Mascherano called Messi “the best player in history.” Against New England, Messi scored in the 27th and 38th minutes, both assisted by Sergio Busquets. Carles Gil pulled one back in the 79th, but Miami held on for the win. Messi also holds MLS records for most assists (5) and most goal contributions (6) in a single game. His 58 total goal contributions are a record for Inter Miami.",
    "image": "https://ichef.bbci.co.uk/ace/standard/800/cpsprodpb/6c15/live/9b39a380-5d53-11f0-9680-eb6b1ff651a1.jpg.webp"
  },
  {
    "title": "Liverpool to retire number 20 in honour of Jota",
    "date": "11 July 2025",
    "author": "Mandeep Sanghera",
    "summary": "Liverpool will retire the number 20 shirt in honour of Diogo Jota, who tragically died in a car crash alongside his brother André Silva. The decision, made in consultation with Jota’s wife Rute Cardoso and his family, means no Liverpool player—men’s, women’s, or academy—will wear the number again. Jota joined from Wolves in 2020, scoring 65 goals in 182 games and helping the Reds win the FA Cup, League Cups (2022, 2024), and their 20th league title in 2024. The club shared a tribute video titled “Forever our number 20” at 20:20 BST on Friday. Fenway Sports Group’s Michael Edwards said it’s the first time in Liverpool’s history a shirt number has been retired, calling it a “unique tribute to a uniquely wonderful person.” Jota and his brother died when their car suffered a tyre blowout on July 3. Jota was returning to Liverpool by road after doctors advised against flying due to recent minor surgery. Their funeral was held in Gondomar, Portugal, with a large Liverpool presence.",
    "image": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/db87/live/af8d0620-5e8d-11f0-b003-c12cdae35db2.jpg.webp"
  },
  {
    "title": "Lamine Yamal turns 18 and takes centre stage at Barcelona",
    "date": "13 July 2025",
    "author": "Joe Crogh",
    "summary": "Lamine Yamal, still only 17, is already being hailed as Barcelona's next big star — but he refuses comparisons to Messi, saying he's \"making his own way.\" By 18, he'll have played over 100 senior games, a far cry from Messi's nine at the same age. On and off the pitch, Yamal shows maturity beyond his years — balancing fame, faith, and fun with discipline. He grew up in Rocafonda, a tough neighborhood he proudly represents with his signature \"304\" goal celebration. Despite being a teenager, he's already won La Liga, Copa del Rey, Spanish Super Cup, and the Euro with Spain. Barcelona recently extended his contract till 2031 with a €1bn release clause. His stats are jaw-dropping: 18 goals and 25 assists last season. Setbacks like UCL and Nations League defeats haven’t shaken him — he just resets and moves forward. Well-liked in the locker room and respected by teammates, Yamal thrives under pressure yet stays grounded. He’s not trying to be the next Messi — just the first Lamine Yamal.",
    "image": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/8be7/live/0351bcf0-5da9-11f0-994b-7bf5a5074c2f.jpg.webp"
  }
]
