[
  {
    "title": "Nvidia becomes world's first $4tn company",
    "date": "Wed 10 Jul 2025",
    "author": "Charlotte Edwards",
    "summary": "Nvidia has become the first company to reach a $4 trillion market value, with shares rising to $164 on Wednesday. This milestone reflects surging demand for AI chips, which power technologies like ChatGPT. Nvidia first hit a $1 trillion valuation in June 2023 and has skyrocketed since, despite market turbulence from former President Trump's tariff policies.Tech analyst Dan Ives called Nvidia \"the foundation for the AI revolution,\" likening its chips to \"gold and oil.\" Just eight years ago, Nvidia's stock was worth less than 1% of its current value. Once known for its rivalry with AMD in graphics cards, the company now dominates AI hardware. CEO Jensen Huang has gained celebrity status, even being called “the Taylor Swift of tech.” Nvidia’s Q1 revenue hit $44.1 billion, up 69% year-over-year, with strong investor confidence signaling belief in long-term AI growth.",
    "image": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/dd15/live/eb7a0960-5ccd-11f0-ac2f-d518c8150550.jpg.webp"
  },
  {
    "title": "Mystery interstellar object could be oldest known comet",
    "date": "Sat 12 Jul 2025",
    "author": "Georgina Rannard",
    "summary": "\"This is an object from a part of the galaxy we've never seen up close before,\" said Prof Chris Lintott, co-author of the study. \"We think there's a two-thirds chance this comet is older than the solar system, and that it's been drifting through interstellar space ever since.\"Interstellar objects form around other stars, at the start of those stars' lives, explains Mr Hopkins. \"This connection back to their parent stars means that we can look at the stellar population of the Milky Way,\" he adds. Later this year, 3I/Atlas should be visible from Earth using amateur telescopes. Before 3I/Atlas soared into view, just two others had been seen. One was called 1I/'Oumuamua, found in 2017 and another called 2I/Borisov, discovered in 2019. Astronomers globally are currently gearing up to start using a new, very powerful telescope in Chile, called the Vera C Rubin. When it starts fully surveying the southern night sky later this year, scientists expect that it could discover between five and 50 new interstellar objects.",
    "image": "https://ichef.bbci.co.uk/news/1024/cpsprodpb/6a3c/live/78c4b920-5e48-11f0-b5c5-012c5796682d.jpg.webp"
  }
]
