[
  {
    "title": "The ski resort Olympians flock to each summer'",
    "date": "6 July 2025",
    "author": "Chadner Navarro",
    "summary": "Ski Portillo, nestled in Chile’s Andes, is a remote, all-inclusive resort known for its timeless charm and serious skiing. With no town and limited rooms, it offers little beyond skiing—exactly what its devoted fans love. Founded in 1949, it features 35 trails and a vintage yellow hotel, attracting Olympians and passionate skiers alike. The resort’s off-piste terrain and old-school atmosphere make it a cult favorite. Olympians like Breezy Johnson train here, praising its compact, convenient setup. There are no TVs in rooms, but guests enjoy hot tubs, heli-skiing, and Wine Week events. Despite updates, Portillo stays rooted in tradition, emphasizing community and shared experiences. Many guests return annually, forming lifelong bonds and even romantic relationships. Portillo is less about luxury, more about unforgettable skiing and connection. “Life happens on the slopes and in the hotel,” says co-owner Ellen Guidera Purcell.",
    "image": "https://ichef.bbci.co.uk/images/ic/1024xn/p0lmw7st.jpg.webp"
  },
  {
    "title": "How Chiwetel Ejiofor is spending his summer in London",
    "date": "2 July 2025",
    "author": "Gregory Wakeman",
    "summary": "BAFTA-winning actor Chiwetel Ejiofor shares his favorite ways to enjoy summer in London. Born in Forest Gate, he's a longtime Crystal Palace fan, thrilled by their FA Cup win—despite missing the match due to filming. Ejiofor stars in *The Life of Chuck* and returns in *The Old Guard 2* this July. When not working, he soaks up London's summer vibes, calling the city \"fun and delirious\" in the sun. He loves Exmouth Market for its energy and Regents Park for tennis and running, though Hyde Park is now closer. A fan of Wimbledon, he hopes to catch a match this season. Rainy days see him in the British Museum or British Library, often for role research. He cherishes the South Bank’s cultural scene and the National Theatre, especially The Olivier stage. The Young Vic also holds a special place in his heart from years of performances and workshops. For Ejiofor, summer in London is all about parks, culture, and community.",
    "image": "https://ichef.bbci.co.uk/images/ic/1024xn/p0llj1r2.jpg.webp"
  }
]
